taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.5.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KWxx_DFP</name>
  <description>NXP Kinetis KWxx Series Device Support</description>

  <releases>
    <release version="1.5.0" date="2016-10-04">
      Reworked KWxx_DFP.
       - changed vendor to NXP.
       - renamed subfamilies according NXP.
       - updated documentation.
       - Updated boards description.
       - changed device vendor to NXP in projects.
      Updated KW21Z, KW31Z, KW41Z device support.
      Added FRDM-KW41Z example.
    </release>
    <release version="1.4.0" date="2016-04-04">
      Added KW21Z, KW31Z, KW41Z device support.
    </release>
    <release version="1.3.0" date="2015-10-09">
      Renamed device MKW01Z128xxx5 to MKW01Z128xxx4.
    </release>
    <release version="1.2.0" date="2015-07-10">
      Added FRDM-KW40Z board support.
      Corrected KW40Z Flash Algorithm.
    </release>
    <release version="1.1.0" date="2015-04-29">
      Changed device names according processor expert.
      Added KW4x series device support.
      Updated MKW30Z4, MKW20Z device support
      Corrected SRAM range
    </release>
    <release version="1.0.0">
      First Release version of KWxx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>KWxx</keyword>
  </keywords>

  <devices>
    <family Dfamily="KWxx Series" Dvendor="NXP:11">
      <description>
The Kinetis W series integrates class-leading sub-1 GHz and 2.4 GHz RF transceivers with ARM Cortex cores, providing robust feature sets for reliable, secure and low-power embedded wireless solutions.
      </description>

      <!-- ******************************  KW01Z  ****************************** -->
      <subFamily DsubFamily="KW01Z">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The Kinetis KW0x wireless MCU family embeds a rich set of peripherals with a high-performance bi-directional sub-1 GHz radio, capable of operating over a wide frequency range in the license free industrial, scientific and medical (ISM) frequency bands.
 - Integrates high-performance, low-noise amplifiers and power amplifiers
 - Runs various types of communication protocols, from proprietary (simple media access controller (SMAC)) to globally standardized (IEEE® 802.15.4)
 - Includes hardware, software, tools and reference designs to help simplify development
        </description>

        <!-- ******************************  MKW01Z128xxx4  ****************************** -->
        <device Dname="MKW01Z128xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW01Z4.h" define="MKW01Z128xxx4"/>
          <debug svd="SVD/MKW01Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/MK_P128_48MHZ.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW01Z128.pdf" title="MKW01Z128xxx4 Data Sheet"/>
          <book name="Documents/MKW01xxRM.pdf" title="MKW01Z128xxx4 Reference Manual"/>
        </device>
      </subFamily>

      <!-- ******************************  KW2xD  ****************************** -->
      <subFamily DsubFamily="KW2xD">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p0"/>
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
The Kinetis KW2xD wireless MCU provides a low-power, compact device with integrated IEEE 802.15.4 radio, targeting control and monitoring applications for home and building automation including appliances, access control, climate control, energy management, lighting, safety and security. The KW2xD supports Thread, a lightweight, low latency IPv6 mesh networking stack, specifically designed to meet the requirements of next generation wireless networks. More information on Thread can be found here
 - Provides enough memory to run complicated protocol stacks and user applications on a single IC
 - Protects code and data from unauthorized access or modification
 - Enables a set of specialized operations to improve throughput of encryption/decryption operations
 - Significantly reduces power consumption and extends battery life
        </description>

        <!-- ******************************  MKW21D256xxx5  ****************************** -->
        <device Dname="MKW21D256xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device/Include/MKW21D5.h" define="MKW21D256xxx5"/>
          <debug svd="SVD/MKW21D5.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IROM2"                        start="0x10000000" size="0x00010000" default="0" startup="0"/>
          <memory id="IRAM1"                        start="0x1FFFC000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/MK_P256_50MHZ.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash/MK_D64_50MHZ.FLM"  start="0x10000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW2xDxxx.pdf"   title="MKW21D256xxx5 Data Sheet"/>
          <book name="Documents/MKW2xDxxxRM.pdf" title="MKW21D256xxx5 Reference Manual"/>
        </device>

