taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.5.0.pdsc
        <!-- ******************************  MKW41Z256xxx4  ***************************** -->
        <device Dname="MKW41Z256xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW41Z4.h" define="MKW41Z256xxx4"/>
          <debug svd="SVD/MKW41Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <!--book name="Documents/???.pdf"   title="MKW40Z160xxx4 Data Sheet"/-->
          <!--book name="Documents/???RM.pdf" title="MKW40Z160xxx4 Reference Manual"/-->
        </device>

        <!-- ******************************  MKW41Z512xxx4  ***************************** -->
        <device Dname="MKW41Z512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW41Z4.h" define="MKW41Z512xxx4"/>
          <debug svd="SVD/MKW41Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00020000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P512_2KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <!--book name="Documents/???.pdf"   title="MKW40Z160xxx4 Data Sheet"/-->
          <!--book name="Documents/???RM.pdf" title="MKW40Z160xxx4 Reference Manual"/-->
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="MKW01Z4 CMSIS">
      <description>NXP Kinetis KW01 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW01Z128xxx4"/>
    </condition>

    <condition id="MKW21D5 CMSIS">
      <description>NXP Kinetis KW21 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW21D256xxx5"/>
      <accept Dname="MKW21D512xxx5"/>
    </condition>

    <condition id="MKW22D5 CMSIS">
      <description>NXP Kinetis KW22 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW22D512xxx5"/>
    </condition>

    <condition id="MKW24D5 CMSIS">
      <description>NXP Kinetis KW24 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW24D512xxx5"/>
    </condition>

    <condition id="MKW20Z4 CMSIS">
      <description>NXP Kinetis KW20 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW20Z160xxx4"/>
    </condition>

    <condition id="MKW30Z4 CMSIS">
      <description>NXP Kinetis KW30 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW30Z160xxx4"/>
    </condition>

    <condition id="MKW40Z4 CMSIS">
      <description>NXP Kinetis KW40 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW40Z160xxx4"/>
    </condition>

    <condition id="MKW21Z4 CMSIS">
      <description>NXP Kinetis KW21 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW21Z256xxx4"/>
      <accept Dname="MKW21Z512xxx4"/>
    </condition>

    <condition id="MKW31Z4 CMSIS">
      <description>NXP Kinetis KW31 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW31Z256xxx4"/>
      <accept Dname="MKW31Z512xxx4"/>
    </condition>

    <condition id="MKW41Z4 CMSIS">
      <description>NXP Kinetis KW41 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKW41Z256xxx4"/>
      <accept Dname="MKW41Z512xxx4"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup MKW01Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW01Z4 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW01Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW01Z4.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW21D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW21D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW21D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW21D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW22D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW22D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW22D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW22D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

