taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.5.0.pdsc
    <!-- Startup MKW24D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW24D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW24D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW24D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW20Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW20Z4 CMSIS">
      <description>System Startup for Kinetis KW20 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW20Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW20Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW20Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW30Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW30Z4 CMSIS">
      <description>System Startup for Kinetis KW30 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW30Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW30Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW30Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW40Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW40Z4 CMSIS">
      <description>System Startup for Kinetis KW4x 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW40Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW40Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW40Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW21Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW21Z4 CMSIS">
      <description>System Startup for Kinetis KW21 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW21Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW21Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW21Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW31Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW31Z4 CMSIS">
      <description>System Startup for Kinetis KW31 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW31Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW31Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW31Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW41Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW41Z4 CMSIS">
      <description>System Startup for Kinetis KW41 48MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKW41Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKW41Z4.c"       attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKW41Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <bundle Cbundle="FRDM-KW40Z" Cclass="Board Support" Cversion="1.0.0">
      <description>FRDM-KW40Z Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKW40Z4 CMSIS">
      <description>Button driver for NXP FRDM-KW40Z board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KW40Z/Common/Buttons_FRDM-KW40Z.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="MKW40Z4 CMSIS">
      <description>LED driver for NXP FRDM-KW40Z board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KW40Z/Common/LED_FRDM-KW40Z.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="FRDM-KW41Z" Cclass="Board Support" Cversion="1.0.0">
      <description>FRDM-KW41Z Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKW41Z4 CMSIS">
      <description>Button driver for NXP FRDM-KW41Z board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KW41Z/Common/Buttons_FRDM-KW41Z.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="MKW41Z4 CMSIS">
      <description>LED driver for NXP FRDM-KW41Z board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KW41Z/Common/LED_FRDM-KW41Z.c"/>
        </files>
      </component>
    </bundle>
  </components>

