taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.5.0.pdsc
  <boards>
    <board name="TWR-KW21D256" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKW21D256xxx5"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KWxx Series" DsubFamily="KW2x"/>
      <description>TWR-KW2x: Kinetis KW2x Tower System Modules.</description>
      <image small="Boards/NXP/TWR-KW21D256/Documents/TWR-KW2x_small.jpg"/>
      <book category="overview" name="http://www.nxp.com/products/microcontrollers-and-processors/arm-processors/kinetis-cortex-m-mcus/w-series-wireless-m0-plus-m4/kinetis-kw2x-tower-system-modules:TWR-KW2x"  title="TWR-KW2x: Kinetis KW2x Tower System Modules"/>
      <book category="setup"    name="Boards/NXP/TWR-KW21D256/Documents/TWRMKW2XQSG.pdf"  title="Quick Start Guide"/>
      <book category="manual"   name="Boards/NXP/TWR-KW21D256/Documents/TWR-KW2XHWRM.pdf" title="TWR-KW2x Hardware Reference Manual"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="4"              name="push button switches"/>
      <feature type="LED"            n="4"              name="blue LED indicators"/>
    </board>

    <board name="FRDM-KW40Z" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKW40Z160xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="KW4x"/>
      <description>FRDM-KW40Z: NXP Freedom Development Platform for Kinetis KW40Z/30Z/20Z.</description>
      <image small="Boards/NXP/FRDM-KW40Z/Documents/FRDM-KW40Z_small.jpg"
             large="Boards/NXP/FRDM-KW40Z/Documents/FRDM-KW40Z_large.jpg"/>
      <book category="overview" name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/freedom-development-boards/freescale-freedom-development-platform-for-kinetis-kw40z-30z-20z-mcus:FRDM-KW40Z"  title="FRDM-KW40Z: NXP Freedom Development Platform for Kinetis KW40Z/30Z/20Z"/>
      <book category="manual" name="Boards/NXP/FRDM-KW40Z/Documents/FRDMKW40ZUG.pdf"                        title="FRDM-KW40Z NXP Freedom Development Board User's Guide"/>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <feature type="USB"           n="1"              name="Micro USB type B connector"/>
      <feature type="Button"        n="3"              name="2x user, Reset"/>
      <feature type="Button"        n="2"              name="2x capacitive touch"/>
      <feature type="LED"           n="7"              name="1x blue, 4x red, SDA, Power"/>
      <feature type="Accelerometer" n="1"              name="FXOS8700CQ low-power 6-axis linear accelerometer and magnetometer"/>
      <feature type="ArduinoFF"     n="1"              name="Form factor compatible with Arduino"/>
      <feature type="Batt"          n="1"              name="Battery"/>
      <feature type="IrDA"          n="1"              name="Diode Transceiver"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board name="FRDM-KW41Z" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKW41Z512xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="KW4x"/>
      <description>FRDM-KW40Z: NXP Freedom Development Platform for Kinetis KW40Z/30Z/20Z.</description>
      <!--image small="Boards/NXP/FRDM-KW40Z/Documents/FRDM-KW40Z_small.jpg"
             large="Boards/NXP/FRDM-KW40Z/Documents/FRDM-KW40Z_large.jpg"/-->
      <!--book category="overview" name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/freedom-development-boards/freescale-freedom-development-platform-for-kinetis-kw40z-30z-20z-mcus:FRDM-KW40Z"  title="FRDM-KW40Z: NXP Freedom Development Platform for Kinetis KW40Z/30Z/20Z"/-->
      <!--book category="manual" name="Boards/NXP/FRDM-KW40Z/Documents/FRDMKW40ZUG.pdf"                        title="FRDM-KW40Z NXP Freedom Development Board User's Guide"/-->
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <feature type="USB"           n="1"              name="Micro USB type B connector"/>
      <feature type="Button"        n="3"              name="2x user, Reset"/>
      <feature type="Button"        n="2"              name="2x capacitive touch"/>
      <feature type="LED"           n="4"              name="1x RGB, 1x red, SDA, Power"/>
      <feature type="ArduinoFF"     n="1"              name="Form factor compatible with Arduino"/>
      <feature type="Batt"          n="1"              name="Battery"/>
      <feature type="IrDA"          n="1"              name="Diode Transceiver"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- TWR-KW21D256 Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KW21D256/Blinky">
      <description>Blinky example</description>
      <board name="TWR-KW21D256" vendor="NXP" Dvendor="NXP:11" Dname="MKW21D256xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KW21D256/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KW21D256" vendor="NXP" Dvendor="NXP:11" Dname="MKW21D256xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-KW40Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-KW40Z/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KW40Z" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-KW41Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-KW41Z/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KW41Z" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
